{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOM]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Punctuation",
    "behavior": "Isolated"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[EOM]": 1,
      "#": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "+": 6,
      "-": 7,
      ".": 8,
      "/": 9,
      "0": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "9": 19,
      "=": 20,
      "@": 21,
      "A": 22,
      "B": 23,
      "C": 24,
      "E": 25,
      "F": 26,
      "G": 27,
      "H": 28,
      "I": 29,
      "K": 30,
      "L": 31,
      "M": 32,
      "N": 33,
      "O": 34,
      "P": 35,
      "R": 36,
      "S": 37,
      "T": 38,
      "X": 39,
      "Z": 40,
      "[": 41,
      "\\": 42,
      "]": 43,
      "a": 44,
      "b": 45,
      "c": 46,
      "e": 47,
      "g": 48,
      "i": 49,
      "l": 50,
      "n": 51,
      "o": 52,
      "p": 53,
      "r": 54,
      "s": 55,
      "t": 56,
      "cc": 57,
      "CC": 58,
      "c1": 59,
      "c2": 60,
      "EO": 61,
      "EOM": 62,
      "ccc": 63,
      "cccc": 64,
      "NC": 65,
      "c3": 66,
      "CCC": 67,
      "OC": 68,
      "c1ccc": 69,
      "cc1": 70,
      "nc": 71,
      "CCCC": 72,
      "CO": 73,
      "Cl": 74,
      "c1cccc": 75,
      "c2cccc": 76,
      "c1cc": 77,
      "c2ccc": 78,
      "CCN": 79,
      "n1": 80,
      "C1": 81,
      "CN": 82,
      "cc2": 83,
      "c2ccccc2": 84,
      "ccccc": 85,
      "c1ccccc1": 86,
      "n2": 87,
      "nH": 88,
      "CC1": 89,
      "c4": 90,
      "C2": 91,
      "c2c": 92,
      "N1": 93,
      "c3ccc": 94,
      "ccccc3": 95,
      "c1c": 96,
      "cc3": 97,
      "CC2": 98,
      "CCO": 99,
      "c3ccccc3": 100,
      "N2": 101,
      "c2cc": 102,
      "c1n": 103,
      "Cc1ccc": 104,
      "1C": 105,
      "CCCCC": 106,
      "nc2": 107,
      "n3": 108,
      "C3": 109,
      "CC3": 110,
      "COc1ccc": 111,
      "c2n": 112,
      "Br": 113,
      "c3c": 114,
      "COC": 115,
      "Cc1cc": 116,
      "COc1cc": 117,
      "c12": 118,
      "c1nc": 119,
      "c3cc": 120,
      "CS": 121,
      "CNC": 122,
      "N3": 123,
      "c3cccc": 124,
      "2C": 125,
      "c2nc": 126,
      "ccccc4": 127,
      "Cc1ccccc1": 128,
      "Cc1c": 129,
      "nn": 130,
      "NCC": 131,
      "ccc2": 132,
      "CCOC": 133,
      "nc1": 134,
      "CCCN": 135,
      "c4ccc": 136,
      "nc3": 137,
      "OCC": 138,
      "ccc1": 139,
      "c5": 140,
      "s1": 141,
      "CCCCCCCC": 142,
      "c4ccccc4": 143,
      "1O": 144,
      "Nc1ccc": 145,
      "CCCNC": 146,
      "cc4": 147,
      "c2c1": 148,
      "Cn1": 149,
      "1CC": 150,
      "c2ccc3": 151,
      "o1": 152,
      "NS": 153,
      "NC1": 154,
      "CCCCN": 155,
      "Cc2ccccc2": 156,
      "CC4": 157,
      "N1CCC": 158,
      "cn": 159,
      "CN1": 160,
      "3C": 161,
      "CCNC": 162,
      "2O": 163,
      "c1C": 164,
      "C4": 165,
      "Cc2ccc": 166,
      "ccc3": 167,
      "sc": 168,
      "c23": 169,
      "nc4": 170,
      "ncc": 171,
      "N1C": 172,
      "s2": 173,
      "N1CCN": 174,
      "c1ccc2c": 175,
      "SC": 176,
      "o2": 177,
      "Cc1n": 178,
      "Nc2ccc": 179,
      "oc": 180,
      "Cc1cccc": 181,
      "c2ccccc12": 182,
      "12": 183,
      "N2C": 184,
      "O2": 185,
      "CN2": 186,
      "cc1OC": 187,
      "cn1": 188,
      "2c": 189,
      "CCCCC1": 190,
      "N2CCN": 191,
      "n2c": 192,
      "COc1cccc": 193,
      "n4": 194,
      "O1": 195,
      "CCCCC2": 196,
      "NCCC": 197,
      "1CCC": 198,
      "CCCC2": 199,
      "NC2": 200,
      "n1c": 201,
      "Nc1cc": 202,
      "Nc1n": 203,
      "nn2": 204,
      "c2ccccc21": 205,
      "c2ccc3c": 206,
      "N4": 207,
      "Nc3ccc": 208,
      "cc1C": 209,
      "3O": 210,
      "CCCC1": 211,
      "c4cc": 212,
      "c2cc3": 213,
      "CCN1": 214,
      "2CC": 215,
      "c4c": 216,
      "N2CCC": 217,
      "O3": 218,
      "Nc1nc": 219,
      "nn1": 220,
      "COc1ccccc1": 221,
      "N1CC": 222,
      "c1OC": 223,
      "Nc1cccc": 224,
      "Cc2c": 225,
      "CCC1": 226,
      "CCOCC2": 227,
      "Oc1ccc": 228,
      "3CC": 229,
      "c3nc": 230,
      "c3ccccc23": 231,
      "cccc2": 232,
      "c3n": 233,
      "CCC2": 234,
      "Cc3ccccc3": 235,
      "n2cc": 236,
      "CCS": 237,
      "ncc2": 238,
      "CCCC3": 239,
      "CN1C": 240,
      "C1C": 241,
      "Cn1c": 242,
      "c2cn": 243,
      "4c": 244,
      "c2C": 245,
      "c1O": 246,
      "c1cn": 247,
      "cn2": 248,
      "Nc1ccccc1": 249,
      "CCCCC3": 250,
      "c4cccc": 251,
      "Cc1nc": 252,
      "s3": 253,
      "CCOCC3": 254,
      "cc1Cl": 255,
      "cc12": 256,
      "CCOCC1": 257,
      "4C": 258,
      "NO": 259,
      "n1cc": 260,
      "Cc3ccc": 261,
      "c3c2": 262,
      "c2nnc": 263,
      "OCCO": 264,
      "ccccc5": 265,
      "SCC": 266,
      "N3CCN": 267,
      "1CN": 268,
      "NCCN": 269,
      "c2ncc": 270,
      "CCOc1ccc": 271,
      "CN1CCN": 272,
      "o3": 273,
      "OCCC": 274,
      "NC3": 275,
      "2CCC": 276,
      "Nc2cc": 277,
      "Nc2ccccc2": 278,
      "nc2c1": 279,
      "cc21": 280,
      "c2cccc3": 281,
      "1OC": 282,
      "CCOCCO": 283,
      "Oc2ccc": 284,
      "Cn1cc": 285,
      "c2n1": 286,
      "NCc1ccc": 287,
      "c1cc2": 288,
      "c1nnc": 289,
      "N2CC": 290,
      "CCC3": 291,
      "NCCCC": 292,
      "ccc21": 293,
      "c3ccccc32": 294,
      "1NC": 295,
      "N2CCOCC2": 296,
      "n3c": 297,
      "c6": 298,
      "ccc4": 299,
      "C1CCN": 300,
      "cc1F": 301,
      "CC5": 302,
      "C5": 303,
      "c2cccnc2": 304,
      "nc5": 305,
      "c2ccccc2c1": 306,
      "c5ccc": 307,
      "O4": 308,
      "Na": 309,
      "nc12": 310,
      "c1ncc": 311,
      "CCc1ccc": 312,
      "c5ccccc5": 313,
      "nn3": 314,
      "CN3": 315,
      "OC1": 316,
      "ncc3": 317,
      "n2C": 318,
      "Nc2nc": 319,
      "CCN1C": 320,
      "c1cnc": 321,
      "cccc3": 322,
      "12C": 323,
      "C1CC": 324,
      "Cc1": 325,
      "CCCCCC": 326,
      "N3CCOCC3": 327,
      "c1cccc2": 328,
      "c2nc3ccccc3": 329,
      "c2ccccn2": 330,
      "C2C": 331,
      "OC2": 332,
      "c1ccn": 333,
      "cccc1": 334,
      "ccc1O": 335,
      "COc1ccc2c": 336,
      "C2CC2": 337,
      "ccc12": 338,
      "n2nc": 339,
      "cc1O": 340,
      "nc32": 341,
      "COc1cc2c": 342,
      "c2cnc": 343,
      "NN": 344,
      "nc21": 345,
      "CCn1c": 346,
      "cc5": 347,
      "1CCCN1C": 348,
      "c1cc2c": 349,
      "OCCN": 350,
      "c21": 351,
      "ccccc34": 352,
      "cc2Cl": 353,
      "N3CCC": 354,
      "c2ccncc2": 355,
      "COP": 356,
      "OCc1ccccc1": 357,
      "cn3": 358,
      "Cc1cnc": 359,
      "NNC": 360,
      "cc2c1": 361,
      "c3nc4": 362,
      "no1": 363,
      "OCO3": 364,
      "CCCO": 365,
      "N1CCOCC1": 366,
      "N3C": 367,
      "Nc2cccc": 368,
      "c2ccccc2C": 369,
      "CN2C": 370,
      "4O": 371,
      "cc2C": 372,
      "C1CC1": 373,
      "C3CC3": 374,
      "4CC": 375,
      "Nc3ccccc3": 376,
      "CCCCNC": 377,
      "c2cc3c": 378,
      "n1C": 379,
      "n3cc": 380,
      "c1cccnc1": 381,
      "cs1": 382,
      "c1ccc2": 383,
      "CCOCC4": 384,
      "cc23": 385,
      "c2cccs2": 386,
      "Oc3ccc": 387,
      "OP": 388,
      "cc2F": 389,
      "21": 390,
      "OCO2": 391,
      "n2cn": 392,
      "Nc3cc": 393,
      "CCCC4": 394,
      "ccc23": 395,
      "Nc2n": 396,
      "Nc1c": 397,
      "c2ccco2": 398,
      "CCCCCCC": 399,
      "CCc1ccccc1": 400,
      "C2CCN": 401,
      "c3ccccn3": 402,
      "23": 403,
      "5CC": 404,
      "c3cccnc3": 405,
      "OCc2ccccc2": 406,
      "sc1": 407,
      "Cc1ccc2c": 408,
      "NCc1ccccc1": 409,
      "CN2CCN": 410,
      "c1nc2ccccc2": 411,
      "C1CCC": 412,
      "NCC1": 413,
      "5C": 414,
      "c3ccc4c": 415,
      "OCO4": 416,
      "Cc2cc": 417,
      "CCn1": 418,
      "2CCN": 419,
      "c1nn": 420,
      "c1cccs1": 421,
      "Cc1nn": 422,
      "ccc2c1": 423,
      "c3C": 424,
      "c1ccccn1": 425,
      "nc23": 426,
      "c3ncc": 427,
      "cc1NC": 428,
      "Nc4ccc": 429,
      "C1CCCCC1": 430,
      "OS": 431,
      "CCN1CCN": 432,
      "COc1cc2": 433,
      "CN1CC": 434,
      "CN1CCC": 435,
      "c1Cl": 436,
      "N2CCCC2": 437,
      "c3ccc4": 438,
      "c2ccc3ccccc3": 439,
      "c3ccncc3": 440,
      "Nc1ccc2c": 441,
      "c1ccco1": 442,
      "2CN": 443,
      "nc1C": 444,
      "cc2c": 445,
      "Nc1ncc": 446,
      "c2nn": 447,
      "Cc1cn": 448,
      "Cn2c": 449,
      "CCC4": 450,
      "C2CC": 451,
      "S1": 452,
      "Cc4ccccc4": 453,
      "c3cn": 454,
      "oc2c1": 455,
      "COc1c": 456,
      "ccn1": 457,
      "2C1": 458,
      "ccccc12": 459,
      "N1CCCC1": 460,
      "c3cnc": 461,
      "c1ccncc1": 462,
      "nc2n1": 463,
      "no": 464,
      "nc3c2": 465,
      "Cc2cccc": 466,
      "c3cccc4": 467,
      "c1s": 468,
      "COc2ccc": 469,
      "c4ccccc34": 470,
      "2OC": 471,
      "1CCN": 472,
      "NCCO": 473,
      "c2ccccc2Cl": 474,
      "c2s": 475,
      "N2CCCCC2": 476,
      "c2csc": 477,
      "nnc": 478,
      "C2CCCCC2": 479,
      "COCC": 480,
      "cc32": 481,
      "CCc1cc": 482,
      "OCCCC": 483,
      "5c": 484,
      "NCc2ccc": 485,
      "no2": 486,
      "ccc1C": 487,
      "c3ccco3": 488,
      "CCCCC4": 489,
      "CSC": 490,
      "N1CCCC": 491,
      "OC3": 492,
      "Oc1ccccc1": 493,
      "Nc2c": 494,
      "ncn2": 495,
      "ncn1": 496,
      "sc2": 497,
      "CSCC": 498,
      "nc2c": 499,
      "N3CC": 500,
      "N5": 501,
      "CCc1c": 502,
      "C1NC": 503,
      "Oc1cc": 504,
      "CCOc1cc": 505,
      "oc1": 506,
      "Nc3cccc": 507,
      "sc2c1": 508,
      "c1nc2c": 509,
      "c3n2": 510,
      "N4CCN": 511,
      "CCCCCCCCCCCC": 512,
      "nc3cc": 513,
      "cc3F": 514,
      "ccccc23": 515,
      "n3C": 516,
      "NC4": 517,
      "Cc4ccc": 518,
      "c2ccc3ccccc3c2": 519,
      "c2ccccc2C1": 520,
      "cc3c": 521,
      "NCCCN": 522,
      "CCSC": 523,
      "2CCCN2C": 524,
      "c3cccs3": 525,
      "CCn1cc": 526,
      "CCCCCCCCCCCCCCCC": 527,
      "cs2": 528,
      "N3CCCC3": 529,
      "c5c": 530,
      "Oc2ccccc2": 531,
      "c5cc": 532,
      "Cn2": 533,
      "C2CCC": 534,
      "1CO": 535,
      "nnc1": 536,
      "c1cncc": 537,
      "Cc1noc": 538,
      "c2ccccc2n1": 539,
      "CN2CCC": 540,
      "c1F": 541,
      "c1ccccc1C": 542,
      "CNS": 543,
      "N1CCCCC1": 544,
      "Cn2cc": 545,
      "n2cnc3c": 546,
      "c1csc": 547,
      "FC": 548,
      "OCc3ccccc3": 549,
      "43C": 550,
      "CCc2ccccc2": 551,
      "c3cc4c": 552,
      "CC3CC": 553,
      "N2CCCC": 554,
      "c1ccccc1Cl": 555,
      "6O": 556,
      "c4c3": 557,
      "NCC2": 558,
      "oc2": 559,
      "Fc1ccc": 560,
      "c3ccccc3C": 561,
      "N3CCCCC3": 562,
      "c3ccccc3C2": 563,
      "32": 564,
      "N4CCOCC4": 565,
      "Clc1ccc": 566,
      "c2nc3c": 567,
      "COc1ccc2": 568,
      "ccc32": 569,
      "ccccc2": 570,
      "ncnc32": 571,
      "nc2c1nc": 572,
      "on1": 573,
      "c2O": 574,
      "cc3Cl": 575,
      "5O": 576,
      "c2ccccc2F": 577,
      "c2ccnc": 578,
      "3CCC": 579,
      "C1O": 580,
      "n12": 581,
      "cccn2": 582,
      "oc2cc": 583,
      "COCCN": 584,
      "s4": 585,
      "COc1cccc2": 586,
      "C4CC4": 587,
      "c2cc1OC": 588,
      "c2nnn": 589,
      "CSSC": 590,
      "c3nn": 591,
      "c3nc4ccccc4": 592,
      "ccc2n1": 593,
      "cccc4": 594,
      "NCc2ccccc2": 595,
      "c2C1": 596,
      "ncnc": 597,
      "C1N": 598,
      "S2": 599,
      "Oc2cc": 600,
      "c2sc": 601,
      "c2noc": 602,
      "CCN2": 603,
      "CC1CCCCC1": 604,
      "c1sc": 605,
      "c3cc4": 606,
      "ccc1OC": 607,
      "ncc4": 608,
      "c2cc3ccccc3": 609,
      "c3nnc": 610,
      "Cc1cc2": 611,
      "CC1CCN": 612,
      "c34": 613,
      "CCCS": 614,
      "n4c": 615,
      "nc2C": 616,
      "21C": 617,
      "c1NC": 618,
      "12CC": 619,
      "1N": 620,
      "CN2CC": 621,
      "N1CCC2": 622,
      "c2cncc": 623,
      "C3CCCCC3": 624,
      "COC1": 625,
      "o4": 626,
      "ncc1": 627,
      "c32": 628,
      "CC2CC2": 629,
      "CN4": 630,
      "Cc1cccc2": 631,
      "c2c1C": 632,
      "c2cccc3ccccc23": 633,
      "CCl": 634,
      "nc2c1ncn2": 635,
      "ccc1Cl": 636,
      "cc1S": 637,
      "n5": 638,
      "CCCl": 639,
      "c3ccccc3c2": 640,
      "CC1C": 641,
      "Cc3c": 642,
      "n4cc": 643,
      "nc2ccccc12": 644,
      "nc3c": 645,
      "nc2cc": 646,
      "cccc12": 647,
      "Nc1nnc": 648,
      "1CCCC": 649,
      "Nc2ccc3c": 650,
      "c1ccc2nc": 651,
      "C12": 652,
      "c2nc3cc": 653,
      "c4ccccc43": 654,
      "c2o": 655,
      "c1ccccc1F": 656,
      "cccc1C": 657,
      "CCCn1c": 658,
      "CCN3": 659,
      "c2cnn": 660,
      "OCC1": 661,
      "cnc2c": 662,
      "C3C": 663,
      "cc3C": 664,
      "Nc2ncc": 665,
      "Oc3ccccc3": 666,
      "C6": 667,
      "3OC": 668,
      "NCc3ccc": 669,
      "C3CCN": 670,
      "Oc1cccc": 671,
      "c1c2c": 672,
      "cc2C1": 673,
      "Cc3cccc": 674,
      "NC1CCCCC1": 675,
      "OCCO2": 676,
      "c4nc": 677,
      "ccc1F": 678,
      "CCOc1ccccc1": 679,
      "ccn2": 680,
      "Cn1nc": 681,
      "O5": 682,
      "ccc5": 683,
      "ccc3c2": 684,
      "Cc1nnc": 685,
      "NC1CCN": 686,
      "n3ccc": 687,
      "c3cnn": 688,
      "c2ccc3nc": 689,
      "CCc1nc": 690,
      "c5cccc": 691,
      "nc2ccc": 692,
      "c4n": 693,
      "c1ccc2ccccc2c1": 694,
      "2CO": 695,
      "CCN2C": 696,
      "c7": 697,
      "CC1CC1": 698,
      "C1CCCC1": 699,
      "23C": 700,
      "c1cccc2ccccc12": 701,
      "OCCO3": 702,
      "c2ncccc2": 703,
      "nc3ccccc23": 704,
      "c1ccnc": 705,
      "Cc1cc2c": 706,
      "c1N": 707,
      "c4cn": 708,
      "c3ccccc3Cl": 709,
      "OCc2ccc": 710,
      "c1cc2cc": 711,
      "cc3c2": 712,
      "nn12": 713,
      "n1nc": 714,
      "CNCC": 715,
      "CN3CCN": 716,
      "CC1CC": 717,
      "oc3": 718,
      "CO2": 719,
      "ccccc6": 720,
      "CC4CC": 721,
      "ccc34": 722,
      "SC1": 723,
      "cc2O": 724,
      "c1nc2cc": 725,
      "c2F": 726,
      "C1CN": 727,
      "c13": 728,
      "ccc2C": 729,
      "c1ccccc12": 730,
      "sc1C": 731,
      "n3nc": 732,
      "n1Cc1ccc": 733,
      "NCCN1": 734,
      "CSc1nnc": 735,
      "ccccc4c3": 736,
      "c2c3c": 737,
      "c3ccnc": 738,
      "CCN1CCC": 739,
      "c1o": 740,
      "nc2c1c": 741,
      "Cc1ncc": 742,
      "CCCCCCCCC": 743,
      "C2CCCC2": 744,
      "CCOP": 745,
      "c3nccc": 746,
      "Si": 747,
      "OCC2": 748,
      "c1cc2ccccc2": 749,
      "c2ncn": 750,
      "c1cnn": 751,
      "oc12": 752,
      "Cc1csc": 753,
      "NC2CCCCC2": 754,
      "c1noc": 755,
      "n2c1": 756,
      "NCc3ccccc3": 757,
      "CCCCCCCCCC": 758,
      "NCCNC": 759,
      "c1nc2ccc": 760,
      "CSc1ccc": 761,
      "Cc1cccnc1": 762,
      "CNc1nc": 763,
      "nn4": 764,
      "c2Cl": 765,
      "CC1CN": 766,
      "N2CCC3": 767,
      "CCO2": 768,
      "Oc1c": 769,
      "cccc1Cl": 770,
      "c2oc": 771,
      "c2ncnc": 772,
      "Cc3cc": 773,
      "nc4c": 774,
      "Nc3nc": 775,
      "C1c1ccc": 776,
      "1c1ccc": 777,
      "2CCCC": 778,
      "nc2ccccc21": 779,
      "cc2s1": 780,
      "CCc2ccc": 781,
      "c1c2ccccc2": 782,
      "sc3": 783,
      "n2ccnc2": 784,
      "cc34": 785,
      "CCOC1": 786,
      "7O": 787,
      "CCc3ccccc3": 788,
      "C1CCCN": 789,
      "c6ccc": 790,
      "CCOCCOCCOCCO": 791,
      "ccccc45": 792,
      "CCCOc1ccc": 793,
      "c4ccccn4": 794,
      "c1nnn": 795,
      "cc6": 796,
      "cc2OC": 797,
      "1C2": 798,
      "c2nc3ccc": 799,
      "2NC": 800,
      "on2": 801,
      "c4cccnc4": 802,
      "34": 803,
      "nc3ccc": 804,
      "CC2C": 805,
      "cccc2Cl": 806,
      "cc1Br": 807,
      "COc1ccccc1N1CCN": 808,
      "3c": 809,
      "cc2n1": 810,
      "c3ccccc3F": 811,
      "c2cc3cc": 812,
      "CC3CC3": 813,
      "cn4": 814,
      "c3cncc": 815,
      "COCCO": 816,
      "c1nccc": 817,
      "CCNS": 818,
      "nc1N": 819,
      "2H": 820,
      "c2ncnc3": 821,
      "Nc1cccc2": 822,
      "CO1": 823,
      "cnc2": 824,
      "nn23": 825,
      "n2ccc": 826,
      "N4CCC": 827,
      "CCc1cccc": 828,
      "6C": 829,
      "c4ccncc4": 830,
      "CCCN1C": 831,
      "CCCCCNC": 832,
      "c2ccccc2O": 833,
      "C2O": 834,
      "CCOCC5": 835,
      "CSc1nc": 836,
      "c3ccccc3n2": 837,
      "ccc2O": 838,
      "2N": 839,
      "Cc2cnc": 840,
      "COc2ccccc2": 841,
      "n3c2": 842,
      "COc3ccc": 843,
      "C3CC": 844,
      "nc3n2": 845,
      "N3CCCC": 846,
      "Nc1ccccc1C": 847,
      "c4nc5": 848,
      "c1ccccc1O": 849,
      "CSc2nnc": 850,
      "CCN1CC": 851,
      "c4cnc": 852,
      "ncnc21": 853,
      "Oc2c": 854,
      "c3C2": 855,
      "n3ccnc3": 856,
      "c1ccc2cc": 857,
      "cccc23": 858,
      "Oc2cccc": 859,
      "ccc2F": 860,
      "Cc1o": 861,
      "ncn3": 862,
      "COc1ccccc1C": 863,
      "CC1CCC": 864,
      "3CC4CC": 865,
      "ccc1NC": 866,
      "c6ccccc6": 867,
      "3C2": 868,
      "c4ccc5": 869,
      "Nc4cc": 870,
      "3CCN": 871,
      "CC2CCCCC2": 872,
      "1CS": 873,
      "Cc1ccc2nc": 874,
      "C1OC": 875,
      "C3CCC": 876,
      "cc3OC": 877,
      "n1ccnc1": 878,
      "NC1CC1": 879,
      "Oc1ccc2c": 880,
      "nc43": 881,
      "NC2CCN": 882,
      "CCCOC": 883,
      "NOC": 884,
      "c2nc3ccccc3s2": 885,
      "OCCCN": 886,
      "NCc1cccc": 887,
      "1CCCN1": 888,
      "Nc4ccccc4": 889,
      "cc3C2": 890,
      "ccc3n2": 891,
      "NCCS": 892,
      "Cc2ccc3c": 893,
      "NCCN2": 894,
      "c2no": 895,
      "nc34": 896,
      "NCC3": 897,
      "NCCc1ccccc1": 898,
      "c5c4": 899,
      "CP": 900,
      "N1c1ccc": 901,
      "CC6": 902,
      "CCOC2": 903,
      "NCc1cc": 904,
      "CCCCCCCCCCC": 905,
      "1CCCN": 906,
      "n4ccc": 907,
      "c3s": 908,
      "NCCc1ccc": 909,
      "Nc2nnc": 910,
      "C3CCCC3": 911,
      "c4ccco4": 912,
      "nnc2": 913,
      "CF": 914,
      "Cc1ccccc1C": 915,
      "Nc1nc2c": 916,
      "c2nccc": 917,
      "ccc2Cl": 918,
      "c1ccccc1NC": 919,
      "N1N": 920,
      "c4cccc5": 921,
      "COc1nc": 922,
      "nc54": 923,
      "n4cnc5": 924,
      "c4ccc5c": 925,
      "12CCC": 926,
      "CCCC5": 927,
      "c2ccccc2S": 928,
      "c3cccc4ccccc34": 929,
      "cccc21": 930,
      "cc1OCC": 931,
      "c4C": 932,
      "n3n2": 933,
      "1c1ccccc1": 934,
      "CCCc1cc": 935,
      "cccc2C": 936,
      "C4C": 937,
      "c1S": 938,
      "4CCC": 939,
      "N2C1": 940,
      "n23": 941,
      "NC1CCCC1": 942,
      "ccc3c": 943,
      "CCNC2": 944,
      "Nc3c": 945,
      "n2nn": 946,
      "c2ccsc2": 947,
      "c1CC": 948,
      "COS": 949,
      "C1C2": 950,
      "3CN": 951,
      "cs3": 952,
      "6CC": 953,
      "N4CCCC4": 954,
      "ncnc2": 955,
      "c3ncnc": 956,
      "n2ncc": 957,
      "nc4cc": 958,
      "N1CC2": 959,
      "OC4": 960,
      "Nc2ccccc2C": 961,
      "NCCCCC": 962,
      "Cc1nc2c": 963,
      "CCCO2": 964,
      "CNC1": 965,
      "c4ccccc4C3": 966,
      "c3F": 967,
      "Nc3ncc": 968,
      "Cn1ccnc1": 969,
      "N4C": 970,
      "Oc3cc": 971,
      "CCO1": 972,
      "c3cc4ccccc4": 973,
      "OCCO4": 974,
      "COC2": 975,
      "OCO5": 976,
      "cnc1": 977,
      "c4cnn": 978,
      "OCc4ccccc4": 979,
      "c1C2": 980,
      "43": 981,
      "N3CCNCC3": 982,
      "c4ncc": 983,
      "nc6": 984,
      "COc1ccccc1NC": 985,
      "Nc2nccc": 986,
      "n2n1": 987,
      "CN3CCC": 988,
      "c1ccccc1C2": 989,
      "Se": 990,
      "ccc2OC": 991,
      "NCc1ccco1": 992,
      "OCc3ccc": 993,
      "nn1C": 994,
      "OCc1ccc": 995,
      "ccn": 996,
      "CCCCCC1": 997,
      "3OP": 998,
      "Nc1nccc": 999,
      "3COP": 1000,
      "cccc3Cl": 1001,
      "Cc1ccc2ccccc2c1": 1002,
      "cc3n2": 1003,
      "1CNC": 1004,
      "2CC3CC": 1005,
      "N1CCc2c": 1006,
      "NCCN3": 1007,
      "NP": 1008,
      "CN2CCOCC2": 1009,
      "no3": 1010,
      "c2ncccn2": 1011,
      "n4cnc5c": 1012,
      "c3ccc4ccccc4c3": 1013,
      "Nc1ncnc2c1ncn2": 1014,
      "Oc4ccc": 1015,
      "cc4F": 1016,
      "COCCNC": 1017,
      "ccc3C": 1018,
      "c5ccccc45": 1019,
      "Cn3c": 1020,
      "NCCOCCO": 1021,
      "c4ccccc4C": 1022,
      "C1c2ccccc2C": 1023
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "c",
        "1"
      ],
      [
        "c",
        "2"
      ],
      [
        "E",
        "O"
      ],
      [
        "EO",
        "M"
      ],
      [
        "cc",
        "c"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "N",
        "C"
      ],
      [
        "c",
        "3"
      ],
      [
        "CC",
        "C"
      ],
      [
        "O",
        "C"
      ],
      [
        "c1",
        "ccc"
      ],
      [
        "cc",
        "1"
      ],
      [
        "n",
        "c"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "C",
        "O"
      ],
      [
        "C",
        "l"
      ],
      [
        "c1",
        "cccc"
      ],
      [
        "c2",
        "cccc"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "c2",
        "ccc"
      ],
      [
        "CC",
        "N"
      ],
      [
        "n",
        "1"
      ],
      [
        "C",
        "1"
      ],
      [
        "C",
        "N"
      ],
      [
        "cc",
        "2"
      ],
      [
        "c2cccc",
        "c2"
      ],
      [
        "cc",
        "ccc"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "n",
        "2"
      ],
      [
        "n",
        "H"
      ],
      [
        "CC",
        "1"
      ],
      [
        "c",
        "4"
      ],
      [
        "C",
        "2"
      ],
      [
        "c2",
        "c"
      ],
      [
        "N",
        "1"
      ],
      [
        "c3",
        "ccc"
      ],
      [
        "ccccc",
        "3"
      ],
      [
        "c1",
        "c"
      ],
      [
        "cc",
        "3"
      ],
      [
        "CC",
        "2"
      ],
      [
        "CC",
        "O"
      ],
      [
        "c3",
        "ccccc3"
      ],
      [
        "N",
        "2"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "c1",
        "n"
      ],
      [
        "C",
        "c1ccc"
      ],
      [
        "1",
        "C"
      ],
      [
        "CC",
        "CCC"
      ],
      [
        "n",
        "c2"
      ],
      [
        "n",
        "3"
      ],
      [
        "C",
        "3"
      ],
      [
        "CC",
        "3"
      ],
      [
        "CO",
        "c1ccc"
      ],
      [
        "c2",
        "n"
      ],
      [
        "B",
        "r"
      ],
      [
        "c3",
        "c"
      ],
      [
        "C",
        "OC"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "CO",
        "c1cc"
      ],
      [
        "c1",
        "2"
      ],
      [
        "c1",
        "nc"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "C",
        "S"
      ],
      [
        "C",
        "NC"
      ],
      [
        "N",
        "3"
      ],
      [
        "c3",
        "cccc"
      ],
      [
        "2",
        "C"
      ],
      [
        "c2",
        "nc"
      ],
      [
        "ccccc",
        "4"
      ],
      [
        "C",
        "c1ccccc1"
      ],
      [
        "C",
        "c1c"
      ],
      [
        "n",
        "n"
      ],
      [
        "N",
        "CC"
      ],
      [
        "cc",
        "c2"
      ],
      [
        "CC",
        "OC"
      ],
      [
        "n",
        "c1"
      ],
      [
        "CCC",
        "N"
      ],
      [
        "c4",
        "ccc"
      ],
      [
        "n",
        "c3"
      ],
      [
        "O",
        "CC"
      ],
      [
        "cc",
        "c1"
      ],
      [
        "c",
        "5"
      ],
      [
        "s",
        "1"
      ],
      [
        "CCCC",
        "CCCC"
      ],
      [
        "c4",
        "ccccc4"
      ],
      [
        "1",
        "O"
      ],
      [
        "N",
        "c1ccc"
      ],
      [
        "CCC",
        "NC"
      ],
      [
        "cc",
        "4"
      ],
      [
        "c2",
        "c1"
      ],
      [
        "C",
        "n1"
      ],
      [
        "1",
        "CC"
      ],
      [
        "c2ccc",
        "3"
      ],
      [
        "o",
        "1"
      ],
      [
        "N",
        "S"
      ],
      [
        "NC",
        "1"
      ],
      [
        "CCCC",
        "N"
      ],
      [
        "C",
        "c2ccccc2"
      ],
      [
        "CC",
        "4"
      ],
      [
        "N1",
        "CCC"
      ],
      [
        "c",
        "n"
      ],
      [
        "CN",
        "1"
      ],
      [
        "3",
        "C"
      ],
      [
        "CC",
        "NC"
      ],
      [
        "2",
        "O"
      ],
      [
        "c1",
        "C"
      ],
      [
        "C",
        "4"
      ],
      [
        "C",
        "c2ccc"
      ],
      [
        "ccc",
        "3"
      ],
      [
        "s",
        "c"
      ],
      [
        "c2",
        "3"
      ],
      [
        "nc",
        "4"
      ],
      [
        "n",
        "cc"
      ],
      [
        "N1",
        "C"
      ],
      [
        "s",
        "2"
      ],
      [
        "N1",
        "CCN"
      ],
      [
        "c1cc",
        "c2c"
      ],
      [
        "S",
        "C"
      ],
      [
        "o",
        "2"
      ],
      [
        "C",
        "c1n"
      ],
      [
        "N",
        "c2ccc"
      ],
      [
        "o",
        "c"
      ],
      [
        "C",
        "c1cccc"
      ],
      [
        "c2cccc",
        "c12"
      ],
      [
        "1",
        "2"
      ],
      [
        "N2",
        "C"
      ],
      [
        "O",
        "2"
      ],
      [
        "CN",
        "2"
      ],
      [
        "cc1",
        "OC"
      ],
      [
        "c",
        "n1"
      ],
      [
        "2",
        "c"
      ],
      [
        "CCCCC",
        "1"
      ],
      [
        "N2",
        "CCN"
      ],
      [
        "n2",
        "c"
      ],
      [
        "CO",
        "c1cccc"
      ],
      [
        "n",
        "4"
      ],
      [
        "O",
        "1"
      ],
      [
        "CCCCC",
        "2"
      ],
      [
        "N",
        "CCC"
      ],
      [
        "1",
        "CCC"
      ],
      [
        "CCCC",
        "2"
      ],
      [
        "NC",
        "2"
      ],
      [
        "n1",
        "c"
      ],
      [
        "N",
        "c1cc"
      ],
      [
        "N",
        "c1n"
      ],
      [
        "n",
        "n2"
      ],
      [
        "c2ccccc2",
        "1"
      ],
      [
        "c2ccc3",
        "c"
      ],
      [
        "N",
        "4"
      ],
      [
        "N",
        "c3ccc"
      ],
      [
        "cc1",
        "C"
      ],
      [
        "3",
        "O"
      ],
      [
        "CCCC",
        "1"
      ],
      [
        "c4",
        "cc"
      ],
      [
        "c2",
        "cc3"
      ],
      [
        "CCN",
        "1"
      ],
      [
        "2",
        "CC"
      ],
      [
        "c4",
        "c"
      ],
      [
        "N2",
        "CCC"
      ],
      [
        "O",
        "3"
      ],
      [
        "N",
        "c1nc"
      ],
      [
        "n",
        "n1"
      ],
      [
        "CO",
        "c1ccccc1"
      ],
      [
        "N1",
        "CC"
      ],
      [
        "c1",
        "OC"
      ],
      [
        "N",
        "c1cccc"
      ],
      [
        "C",
        "c2c"
      ],
      [
        "CCC",
        "1"
      ],
      [
        "CCO",
        "CC2"
      ],
      [
        "O",
        "c1ccc"
      ],
      [
        "3",
        "CC"
      ],
      [
        "c3",
        "nc"
      ],
      [
        "c3cccc",
        "c23"
      ],
      [
        "cccc",
        "2"
      ],
      [
        "c3",
        "n"
      ],
      [
        "CCC",
        "2"
      ],
      [
        "C",
        "c3ccccc3"
      ],
      [
        "n2",
        "cc"
      ],
      [
        "CC",
        "S"
      ],
      [
        "n",
        "cc2"
      ],
      [
        "CCCC",
        "3"
      ],
      [
        "CN",
        "1C"
      ],
      [
        "C1",
        "C"
      ],
      [
        "Cn1",
        "c"
      ],
      [
        "c2c",
        "n"
      ],
      [
        "4",
        "c"
      ],
      [
        "c2",
        "C"
      ],
      [
        "c1",
        "O"
      ],
      [
        "c1c",
        "n"
      ],
      [
        "c",
        "n2"
      ],
      [
        "N",
        "c1ccccc1"
      ],
      [
        "CCCCC",
        "3"
      ],
      [
        "c4",
        "cccc"
      ],
      [
        "C",
        "c1nc"
      ],
      [
        "s",
        "3"
      ],
      [
        "CCO",
        "CC3"
      ],
      [
        "cc1",
        "Cl"
      ],
      [
        "cc1",
        "2"
      ],
      [
        "CCO",
        "CC1"
      ],
      [
        "4",
        "C"
      ],
      [
        "N",
        "O"
      ],
      [
        "n1",
        "cc"
      ],
      [
        "C",
        "c3ccc"
      ],
      [
        "c3",
        "c2"
      ],
      [
        "c2n",
        "nc"
      ],
      [
        "O",
        "CCO"
      ],
      [
        "ccccc",
        "5"
      ],
      [
        "S",
        "CC"
      ],
      [
        "N3",
        "CCN"
      ],
      [
        "1",
        "CN"
      ],
      [
        "N",
        "CCN"
      ],
      [
        "c2n",
        "cc"
      ],
      [
        "CCO",
        "c1ccc"
      ],
      [
        "CN1",
        "CCN"
      ],
      [
        "o",
        "3"
      ],
      [
        "O",
        "CCC"
      ],
      [
        "NC",
        "3"
      ],
      [
        "2",
        "CCC"
      ],
      [
        "N",
        "c2cc"
      ],
      [
        "N",
        "c2ccccc2"
      ],
      [
        "nc2",
        "c1"
      ],
      [
        "cc2",
        "1"
      ],
      [
        "c2cccc",
        "3"
      ],
      [
        "1",
        "OC"
      ],
      [
        "CCO",
        "CCO"
      ],
      [
        "O",
        "c2ccc"
      ],
      [
        "Cn1",
        "cc"
      ],
      [
        "c2",
        "n1"
      ],
      [
        "NC",
        "c1ccc"
      ],
      [
        "c1cc",
        "2"
      ],
      [
        "c1n",
        "nc"
      ],
      [
        "N2",
        "CC"
      ],
      [
        "CCC",
        "3"
      ],
      [
        "N",
        "CCCC"
      ],
      [
        "ccc2",
        "1"
      ],
      [
        "c3ccccc3",
        "2"
      ],
      [
        "1",
        "NC"
      ],
      [
        "N2",
        "CCOCC2"
      ],
      [
        "n3",
        "c"
      ],
      [
        "c",
        "6"
      ],
      [
        "ccc",
        "4"
      ],
      [
        "C1",
        "CCN"
      ],
      [
        "cc1",
        "F"
      ],
      [
        "CC",
        "5"
      ],
      [
        "C",
        "5"
      ],
      [
        "c2ccc",
        "nc2"
      ],
      [
        "nc",
        "5"
      ],
      [
        "c2ccccc2",
        "c1"
      ],
      [
        "c5",
        "ccc"
      ],
      [
        "O",
        "4"
      ],
      [
        "N",
        "a"
      ],
      [
        "n",
        "c12"
      ],
      [
        "c1n",
        "cc"
      ],
      [
        "CC",
        "c1ccc"
      ],
      [
        "c5",
        "ccccc5"
      ],
      [
        "n",
        "n3"
      ],
      [
        "CN",
        "3"
      ],
      [
        "OC",
        "1"
      ],
      [
        "n",
        "cc3"
      ],
      [
        "n2",
        "C"
      ],
      [
        "N",
        "c2nc"
      ],
      [
        "CCN",
        "1C"
      ],
      [
        "c1c",
        "nc"
      ],
      [
        "cccc",
        "3"
      ],
      [
        "1",
        "2C"
      ],
      [
        "C1",
        "CC"
      ],
      [
        "C",
        "c1"
      ],
      [
        "CCCC",
        "CC"
      ],
      [
        "N3",
        "CCOCC3"
      ],
      [
        "c1cccc",
        "2"
      ],
      [
        "c2n",
        "c3ccccc3"
      ],
      [
        "c2cccc",
        "n2"
      ],
      [
        "C2",
        "C"
      ],
      [
        "OC",
        "2"
      ],
      [
        "c1cc",
        "n"
      ],
      [
        "cccc",
        "1"
      ],
      [
        "ccc1",
        "O"
      ],
      [
        "COc1cc",
        "c2c"
      ],
      [
        "C2",
        "CC2"
      ],
      [
        "cc",
        "c12"
      ],
      [
        "n2",
        "nc"
      ],
      [
        "cc1",
        "O"
      ],
      [
        "nc3",
        "2"
      ],
      [
        "COc1cc",
        "2c"
      ],
      [
        "c2c",
        "nc"
      ],
      [
        "N",
        "N"
      ],
      [
        "nc2",
        "1"
      ],
      [
        "CC",
        "n1c"
      ],
      [
        "cc",
        "5"
      ],
      [
        "1CCC",
        "N1C"
      ],
      [
        "c1cc",
        "2c"
      ],
      [
        "O",
        "CCN"
      ],
      [
        "c2",
        "1"
      ],
      [
        "ccccc3",
        "4"
      ],
      [
        "cc2",
        "Cl"
      ],
      [
        "N3",
        "CCC"
      ],
      [
        "c2cc",
        "ncc2"
      ],
      [
        "CO",
        "P"
      ],
      [
        "OC",
        "c1ccccc1"
      ],
      [
        "c",
        "n3"
      ],
      [
        "Cc1c",
        "nc"
      ],
      [
        "N",
        "NC"
      ],
      [
        "cc2",
        "c1"
      ],
      [
        "c3",
        "nc4"
      ],
      [
        "n",
        "o1"
      ],
      [
        "OC",
        "O3"
      ],
      [
        "CCC",
        "O"
      ],
      [
        "N1",
        "CCOCC1"
      ],
      [
        "N3",
        "C"
      ],
      [
        "N",
        "c2cccc"
      ],
      [
        "c2ccccc2",
        "C"
      ],
      [
        "CN",
        "2C"
      ],
      [
        "4",
        "O"
      ],
      [
        "cc2",
        "C"
      ],
      [
        "C1",
        "CC1"
      ],
      [
        "C3",
        "CC3"
      ],
      [
        "4",
        "CC"
      ],
      [
        "N",
        "c3ccccc3"
      ],
      [
        "CCCC",
        "NC"
      ],
      [
        "c2cc3",
        "c"
      ],
      [
        "n1",
        "C"
      ],
      [
        "n3",
        "cc"
      ],
      [
        "c1ccc",
        "nc1"
      ],
      [
        "c",
        "s1"
      ],
      [
        "c1cc",
        "c2"
      ],
      [
        "CCO",
        "CC4"
      ],
      [
        "cc2",
        "3"
      ],
      [
        "c2ccc",
        "s2"
      ],
      [
        "O",
        "c3ccc"
      ],
      [
        "O",
        "P"
      ],
      [
        "cc2",
        "F"
      ],
      [
        "2",
        "1"
      ],
      [
        "OC",
        "O2"
      ],
      [
        "n2",
        "cn"
      ],
      [
        "N",
        "c3cc"
      ],
      [
        "CCCC",
        "4"
      ],
      [
        "ccc2",
        "3"
      ],
      [
        "N",
        "c2n"
      ],
      [
        "N",
        "c1c"
      ],
      [
        "c2ccc",
        "o2"
      ],
      [
        "CCCC",
        "CCC"
      ],
      [
        "CC",
        "c1ccccc1"
      ],
      [
        "C2",
        "CCN"
      ],
      [
        "c3cccc",
        "n3"
      ],
      [
        "2",
        "3"
      ],
      [
        "5",
        "CC"
      ],
      [
        "c3ccc",
        "nc3"
      ],
      [
        "OC",
        "c2ccccc2"
      ],
      [
        "s",
        "c1"
      ],
      [
        "Cc1cc",
        "c2c"
      ],
      [
        "NC",
        "c1ccccc1"
      ],
      [
        "CN2",
        "CCN"
      ],
      [
        "c1n",
        "c2ccccc2"
      ],
      [
        "C1",
        "CCC"
      ],
      [
        "N",
        "CC1"
      ],
      [
        "5",
        "C"
      ],
      [
        "c3ccc",
        "4c"
      ],
      [
        "OC",
        "O4"
      ],
      [
        "C",
        "c2cc"
      ],
      [
        "CC",
        "n1"
      ],
      [
        "2",
        "CCN"
      ],
      [
        "c1n",
        "n"
      ],
      [
        "c1ccc",
        "s1"
      ],
      [
        "Cc1n",
        "n"
      ],
      [
        "ccc2",
        "c1"
      ],
      [
        "c3",
        "C"
      ],
      [
        "c1cccc",
        "n1"
      ],
      [
        "nc2",
        "3"
      ],
      [
        "c3",
        "ncc"
      ],
      [
        "cc1",
        "NC"
      ],
      [
        "N",
        "c4ccc"
      ],
      [
        "C1",
        "CCCCC1"
      ],
      [
        "O",
        "S"
      ],
      [
        "CCN1",
        "CCN"
      ],
      [
        "COc1cc",
        "2"
      ],
      [
        "CN",
        "1CC"
      ],
      [
        "CN1",
        "CCC"
      ],
      [
        "c1",
        "Cl"
      ],
      [
        "N2",
        "CCCC2"
      ],
      [
        "c3ccc",
        "4"
      ],
      [
        "c2ccc3",
        "ccccc3"
      ],
      [
        "c3cc",
        "ncc3"
      ],
      [
        "N",
        "c1ccc2c"
      ],
      [
        "c1ccc",
        "o1"
      ],
      [
        "2",
        "CN"
      ],
      [
        "nc1",
        "C"
      ],
      [
        "cc2",
        "c"
      ],
      [
        "Nc1n",
        "cc"
      ],
      [
        "c2n",
        "n"
      ],
      [
        "Cc1c",
        "n"
      ],
      [
        "C",
        "n2c"
      ],
      [
        "CCC",
        "4"
      ],
      [
        "C2",
        "CC"
      ],
      [
        "S",
        "1"
      ],
      [
        "C",
        "c4ccccc4"
      ],
      [
        "c3c",
        "n"
      ],
      [
        "o",
        "c2c1"
      ],
      [
        "CO",
        "c1c"
      ],
      [
        "cc",
        "n1"
      ],
      [
        "2",
        "C1"
      ],
      [
        "cccc",
        "c12"
      ],
      [
        "N1",
        "CCCC1"
      ],
      [
        "c3c",
        "nc"
      ],
      [
        "c1ccn",
        "cc1"
      ],
      [
        "nc2",
        "n1"
      ],
      [
        "n",
        "o"
      ],
      [
        "nc3",
        "c2"
      ],
      [
        "C",
        "c2cccc"
      ],
      [
        "c3cccc",
        "4"
      ],
      [
        "c1",
        "s"
      ],
      [
        "CO",
        "c2ccc"
      ],
      [
        "c4",
        "ccccc34"
      ],
      [
        "2",
        "OC"
      ],
      [
        "1",
        "CCN"
      ],
      [
        "N",
        "CCO"
      ],
      [
        "c2ccccc2",
        "Cl"
      ],
      [
        "c2",
        "s"
      ],
      [
        "N2",
        "CCCCC2"
      ],
      [
        "c2c",
        "sc"
      ],
      [
        "n",
        "nc"
      ],
      [
        "C2",
        "CCCCC2"
      ],
      [
        "CO",
        "CC"
      ],
      [
        "cc3",
        "2"
      ],
      [
        "CC",
        "c1cc"
      ],
      [
        "O",
        "CCCC"
      ],
      [
        "5",
        "c"
      ],
      [
        "NC",
        "c2ccc"
      ],
      [
        "n",
        "o2"
      ],
      [
        "ccc1",
        "C"
      ],
      [
        "c3ccc",
        "o3"
      ],
      [
        "CCCCC",
        "4"
      ],
      [
        "CS",
        "C"
      ],
      [
        "N1",
        "CCCC"
      ],
      [
        "OC",
        "3"
      ],
      [
        "O",
        "c1ccccc1"
      ],
      [
        "N",
        "c2c"
      ],
      [
        "nc",
        "n2"
      ],
      [
        "nc",
        "n1"
      ],
      [
        "s",
        "c2"
      ],
      [
        "CS",
        "CC"
      ],
      [
        "n",
        "c2c"
      ],
      [
        "N3",
        "CC"
      ],
      [
        "N",
        "5"
      ],
      [
        "CC",
        "c1c"
      ],
      [
        "C1",
        "NC"
      ],
      [
        "O",
        "c1cc"
      ],
      [
        "CCO",
        "c1cc"
      ],
      [
        "o",
        "c1"
      ],
      [
        "N",
        "c3cccc"
      ],
      [
        "s",
        "c2c1"
      ],
      [
        "c1n",
        "c2c"
      ],
      [
        "c3",
        "n2"
      ],
      [
        "N4",
        "CCN"
      ],
      [
        "CCCCCCCC",
        "CCCC"
      ],
      [
        "n",
        "c3cc"
      ],
      [
        "cc3",
        "F"
      ],
      [
        "cccc",
        "c23"
      ],
      [
        "n3",
        "C"
      ],
      [
        "NC",
        "4"
      ],
      [
        "C",
        "c4ccc"
      ],
      [
        "c2ccc3ccccc3",
        "c2"
      ],
      [
        "c2ccccc2",
        "C1"
      ],
      [
        "cc3",
        "c"
      ],
      [
        "N",
        "CCCN"
      ],
      [
        "CC",
        "SC"
      ],
      [
        "2CCC",
        "N2C"
      ],
      [
        "c3ccc",
        "s3"
      ],
      [
        "CC",
        "n1cc"
      ],
      [
        "CCCCCCCC",
        "CCCCCCCC"
      ],
      [
        "c",
        "s2"
      ],
      [
        "N3",
        "CCCC3"
      ],
      [
        "c5",
        "c"
      ],
      [
        "O",
        "c2ccccc2"
      ],
      [
        "c5",
        "cc"
      ],
      [
        "C",
        "n2"
      ],
      [
        "C2",
        "CCC"
      ],
      [
        "1",
        "CO"
      ],
      [
        "nn",
        "c1"
      ],
      [
        "c1c",
        "ncc"
      ],
      [
        "Cc1n",
        "oc"
      ],
      [
        "c2ccccc2",
        "n1"
      ],
      [
        "CN2",
        "CCC"
      ],
      [
        "c1",
        "F"
      ],
      [
        "c1ccccc1",
        "C"
      ],
      [
        "CN",
        "S"
      ],
      [
        "N1",
        "CCCCC1"
      ],
      [
        "C",
        "n2cc"
      ],
      [
        "n2cn",
        "c3c"
      ],
      [
        "c1c",
        "sc"
      ],
      [
        "F",
        "C"
      ],
      [
        "OC",
        "c3ccccc3"
      ],
      [
        "4",
        "3C"
      ],
      [
        "CC",
        "c2ccccc2"
      ],
      [
        "c3cc",
        "4c"
      ],
      [
        "CC3",
        "CC"
      ],
      [
        "N2",
        "CCCC"
      ],
      [
        "c1ccccc1",
        "Cl"
      ],
      [
        "6",
        "O"
      ],
      [
        "c4",
        "c3"
      ],
      [
        "N",
        "CC2"
      ],
      [
        "o",
        "c2"
      ],
      [
        "F",
        "c1ccc"
      ],
      [
        "c3ccccc3",
        "C"
      ],
      [
        "N3",
        "CCCCC3"
      ],
      [
        "c3ccccc3",
        "C2"
      ],
      [
        "3",
        "2"
      ],
      [
        "N4",
        "CCOCC4"
      ],
      [
        "Cl",
        "c1ccc"
      ],
      [
        "c2n",
        "c3c"
      ],
      [
        "COc1cc",
        "c2"
      ],
      [
        "ccc3",
        "2"
      ],
      [
        "cccc",
        "c2"
      ],
      [
        "nc",
        "nc32"
      ],
      [
        "nc2",
        "c1nc"
      ],
      [
        "o",
        "n1"
      ],
      [
        "c2",
        "O"
      ],
      [
        "cc3",
        "Cl"
      ],
      [
        "5",
        "O"
      ],
      [
        "c2ccccc2",
        "F"
      ],
      [
        "c2cc",
        "nc"
      ],
      [
        "3",
        "CCC"
      ],
      [
        "C1",
        "O"
      ],
      [
        "n1",
        "2"
      ],
      [
        "ccc",
        "n2"
      ],
      [
        "o",
        "c2cc"
      ],
      [
        "CO",
        "CCN"
      ],
      [
        "s",
        "4"
      ],
      [
        "COc1cccc",
        "2"
      ],
      [
        "C4",
        "CC4"
      ],
      [
        "c2",
        "cc1OC"
      ],
      [
        "c2n",
        "nn"
      ],
      [
        "CS",
        "SC"
      ],
      [
        "c3",
        "nn"
      ],
      [
        "c3nc4",
        "ccccc4"
      ],
      [
        "ccc2",
        "n1"
      ],
      [
        "cccc",
        "4"
      ],
      [
        "NC",
        "c2ccccc2"
      ],
      [
        "c2",
        "C1"
      ],
      [
        "nc",
        "nc"
      ],
      [
        "C1",
        "N"
      ],
      [
        "S",
        "2"
      ],
      [
        "O",
        "c2cc"
      ],
      [
        "c2",
        "sc"
      ],
      [
        "c2n",
        "oc"
      ],
      [
        "CCN",
        "2"
      ],
      [
        "CC1",
        "CCCCC1"
      ],
      [
        "c1",
        "sc"
      ],
      [
        "c3cc",
        "4"
      ],
      [
        "ccc1",
        "OC"
      ],
      [
        "n",
        "cc4"
      ],
      [
        "c2cc3",
        "ccccc3"
      ],
      [
        "c3n",
        "nc"
      ],
      [
        "Cc1cc",
        "2"
      ],
      [
        "CC1",
        "CCN"
      ],
      [
        "c3",
        "4"
      ],
      [
        "CCC",
        "S"
      ],
      [
        "n4",
        "c"
      ],
      [
        "nc2",
        "C"
      ],
      [
        "2",
        "1C"
      ],
      [
        "c1",
        "NC"
      ],
      [
        "12",
        "CC"
      ],
      [
        "1",
        "N"
      ],
      [
        "CN2",
        "CC"
      ],
      [
        "N1CCC",
        "2"
      ],
      [
        "c2c",
        "ncc"
      ],
      [
        "C3",
        "CCCCC3"
      ],
      [
        "COC",
        "1"
      ],
      [
        "o",
        "4"
      ],
      [
        "n",
        "cc1"
      ],
      [
        "c3",
        "2"
      ],
      [
        "CC2",
        "CC2"
      ],
      [
        "CN",
        "4"
      ],
      [
        "Cc1cccc",
        "2"
      ],
      [
        "c2c1",
        "C"
      ],
      [
        "c2cccc3",
        "ccccc23"
      ],
      [
        "CC",
        "l"
      ],
      [
        "nc2c1nc",
        "n2"
      ],
      [
        "ccc1",
        "Cl"
      ],
      [
        "cc1",
        "S"
      ],
      [
        "n",
        "5"
      ],
      [
        "CCC",
        "l"
      ],
      [
        "c3ccccc3",
        "c2"
      ],
      [
        "CC1",
        "C"
      ],
      [
        "C",
        "c3c"
      ],
      [
        "n4",
        "cc"
      ],
      [
        "n",
        "c2ccccc12"
      ],
      [
        "n",
        "c3c"
      ],
      [
        "n",
        "c2cc"
      ],
      [
        "cccc",
        "12"
      ],
      [
        "Nc1n",
        "nc"
      ],
      [
        "1",
        "CCCC"
      ],
      [
        "N",
        "c2ccc3c"
      ],
      [
        "c1cc",
        "c2nc"
      ],
      [
        "C1",
        "2"
      ],
      [
        "c2n",
        "c3cc"
      ],
      [
        "c4ccccc4",
        "3"
      ],
      [
        "c2",
        "o"
      ],
      [
        "c1ccccc1",
        "F"
      ],
      [
        "cccc",
        "1C"
      ],
      [
        "CCC",
        "n1c"
      ],
      [
        "CCN",
        "3"
      ],
      [
        "c2c",
        "nn"
      ],
      [
        "O",
        "CC1"
      ],
      [
        "cn",
        "c2c"
      ],
      [
        "C3",
        "C"
      ],
      [
        "cc3",
        "C"
      ],
      [
        "N",
        "c2ncc"
      ],
      [
        "O",
        "c3ccccc3"
      ],
      [
        "C",
        "6"
      ],
      [
        "3",
        "OC"
      ],
      [
        "NC",
        "c3ccc"
      ],
      [
        "C3",
        "CCN"
      ],
      [
        "O",
        "c1cccc"
      ],
      [
        "c1",
        "c2c"
      ],
      [
        "cc2",
        "C1"
      ],
      [
        "C",
        "c3cccc"
      ],
      [
        "NC1",
        "CCCCC1"
      ],
      [
        "OCCO",
        "2"
      ],
      [
        "c4",
        "nc"
      ],
      [
        "ccc1",
        "F"
      ],
      [
        "CCO",
        "c1ccccc1"
      ],
      [
        "cc",
        "n2"
      ],
      [
        "Cn1",
        "nc"
      ],
      [
        "O",
        "5"
      ],
      [
        "ccc",
        "5"
      ],
      [
        "ccc3",
        "c2"
      ],
      [
        "Cc1n",
        "nc"
      ],
      [
        "NC1",
        "CCN"
      ],
      [
        "n3",
        "ccc"
      ],
      [
        "c3c",
        "nn"
      ],
      [
        "c2ccc3",
        "nc"
      ],
      [
        "CC",
        "c1nc"
      ],
      [
        "c5",
        "cccc"
      ],
      [
        "n",
        "c2ccc"
      ],
      [
        "c4",
        "n"
      ],
      [
        "c1cc",
        "c2ccccc2c1"
      ],
      [
        "2",
        "CO"
      ],
      [
        "CCN",
        "2C"
      ],
      [
        "c",
        "7"
      ],
